import './App.css';
import Card from './Components/Card/Card.js';
import Game from './Components/Game/Game.js';
import User from './Components/User/User.js';
function App() {
  return (
    <div className="App" >
      {/* <Card 
      Image = "https://image.api.playstation.com/vulcan/img/rnd/202111/0822/zDXM9K2cQiq0vKTDwF0TkAor.png" 
      GameName="FIFA 2022"
      Tags = "Sport Online Football"
      GameDev = "EA Sports"
      /> */}
      {/* <Game
        Image="https://image.api.playstation.com/vulcan/img/rnd/202111/0822/zDXM9K2cQiq0vKTDwF0TkAor.png"
        Title="FIFA 2022"
        Description="FIFA 22  - 29-а за рахунком комп'ютерна гра з серії FIFA в жанрі спортивний симулятор ( футбол ), розроблена компаніями EA Vancouver під видавництвом Electronic Arts . На ПК , PlayStation 4 , PlayStation 5 , Xbox One , Xbox Series X/S та Nintendo Switch . Гра вийшла у жовтні 2021 року. Ultimate Team 
        FIFA 22 Ultimate Team EA включила оновлення деяких функцій ігрового режиму. Насамперед, EA представила карти FUT Heroes, і це карти, які мають унікальну хімію, специфічну для ліги, яка прив'язана до їхнього конкретного моменту героя, забезпечуючи посилання зеленого клубу для будь-якого гравця у тій самій лізі, а також звичайне посилання на країну. До повного списку карт героїв входять: Маріо Гомес , Тім Кехілл , Оле-Гуннар Сульшер , Єжи Дудек , Джо Коул , Олександр Мостовий , Давид Жинола , Іван Кордоба , Фредді Юнгберг , Юрген Колер , Ларс Рікен ,Антоніо Ді Натале , Клінт Демпсі , Абеді Пеле , Хорхе Кампос , Фернандо Морієнтес , Самі Аль-Джабер та Дієго Міліто . Гравці, що входять до складу команди тижня, отримають підвищену статистику карток гравців залежно від їхніх реальних життєвих досягнень, щоб відобразити близькість до реального футболу. У попередніх іграх було доступно 22 гравці, за якими варто спостерігати, і ще 6 додані до FIFA 22. Як і у FIFA 21 , у грі будуть значки FIFA із зображенням колишніх зірок, а у FIFA 22 буде додано більше гравців-легенд, таких як Ікер Касільяс , Робін ван Персі , Уейн Руніта Кафу . У гравців також буде можливість попередньо переглянути срібні та золоті набори гравців, як і в попередній грі, дозволяючи гравцям попередньо переглянути, що вони отримають від набору, перш ніж вирішити, чи купувати його.
        
        Режим кар'єри 
        Також, як і в попередніх частинах, у грі присутній режим кар'єри за гравця або тренера. У кар'єрі за гравця став можливий вихід вашого персонажа на заміну, а в кар'єрі тренера – функція запиту бюджету. у старих частинах гри, але довгий час не з'являлася у нових.
        
        VOLTA Football 22 
        До FIFA 22 можна повернути футбол на вулиці в режимі VOLTA FOOTBALL. Новий стиль ігрового процесу винагороджує вас за вашу майстерність гри. Гра можлива в унікальних подіях в особливих локаціях кожного сезону. Також з'явилася можливість відкриття нового екіпірування в новій системі сезонного прогресу, з якою ви заробляєте досвід для всіх представлених у VOLTA FOOTBALL нагород, в якому режимі ви не грали б.
        
        Нові ліги та кубки 
        У FIFA 22 з'явилася Індійська Ай-Ліга та чотири нові команди в Решта світі. Більше того, у грі продовжує бути неліцензована ліга Бразилії з генерованими гравцями."
        Tags="Sport Online Football"
        Developer="EA Sports"
      /> */}

      <User 
      Image = "https://i.scdn.co/image/ab67616100005174e1408498d7f528e3671616b1"
      UserName = {"John Xina"}
      Description = {"The president of the SIUGames Corporation"}/>

    </div>
  );
}

export default App;
